cmsis-svd/cmsis-svd/data/Spansion/MB9AF31xM.svd
        <!-- REGISTER "PPGC2" -->
        <register derivedFrom="PPGC0">
          <name>PPGC2</name>
          <description>PPG Operation Mode Control Register 2</description>
          <addressOffset>0x205</addressOffset>
        </register>
        <!-- REGISTER "PPGC3" -->
        <register derivedFrom="PPGC0">
          <name>PPGC3</name>
          <description>PPG Operation Mode Control Register 3</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "PPGC4" -->
        <register derivedFrom="PPGC0">
          <name>PPGC4</name>
          <description>PPG Operation Mode Control Register 4</description>
          <addressOffset>0x241</addressOffset>
        </register>
        <!-- REGISTER "PPGC5" -->
        <register derivedFrom="PPGC0">
          <name>PPGC5</name>
          <description>PPG Operation Mode Control Register 5</description>
          <addressOffset>0x240</addressOffset>
        </register>
        <!-- REGISTER "PPGC6" -->
        <register derivedFrom="PPGC0">
          <name>PPGC6</name>
          <description>PPG Operation Mode Control Register 6</description>
          <addressOffset>0x245</addressOffset>
        </register>
        <!-- REGISTER "PPGC7" -->
        <register derivedFrom="PPGC0">
          <name>PPGC7</name>
          <description>PPG Operation Mode Control Register 7</description>
          <addressOffset>0x244</addressOffset>
        </register>
        <!-- REGISTER "PPGC8" -->
        <register derivedFrom="PPGC0">
          <name>PPGC8</name>
          <description>PPG Operation Mode Control Register 8</description>
          <addressOffset>0x281</addressOffset>
        </register>
        <!-- REGISTER "PPGC9" -->
        <register derivedFrom="PPGC0">
          <name>PPGC9</name>
          <description>PPG Operation Mode Control Register 9</description>
          <addressOffset>0x280</addressOffset>
        </register>
        <!-- REGISTER "PPGC10" -->
        <register derivedFrom="PPGC0">
          <name>PPGC10</name>
          <description>PPG Operation Mode Control Register 10</description>
          <addressOffset>0x285</addressOffset>
        </register>
        <!-- REGISTER "PPGC11" -->
        <register derivedFrom="PPGC0">
          <name>PPGC11</name>
          <description>PPG Operation Mode Control Register 11</description>
          <addressOffset>0x284</addressOffset>
        </register>
        <!-- REGISTER "PPGC12" -->
        <register derivedFrom="PPGC0">
          <name>PPGC12</name>
          <description>PPG Operation Mode Control Register 12</description>
          <addressOffset>0x2C1</addressOffset>
        </register>
        <!-- REGISTER "PPGC13" -->
        <register derivedFrom="PPGC0">
          <name>PPGC13</name>
          <description>PPG Operation Mode Control Register 13</description>
          <addressOffset>0x2C0</addressOffset>
        </register>
        <!-- REGISTER "PPGC14" -->
        <register derivedFrom="PPGC0">
          <name>PPGC14</name>
          <description>PPG Operation Mode Control Register 14</description>
          <addressOffset>0x2C5</addressOffset>
        </register>
        <!-- REGISTER "PPGC15" -->
        <register derivedFrom="PPGC0">
          <name>PPGC15</name>
          <description>PPG Operation Mode Control Register 15</description>
          <addressOffset>0x2C4</addressOffset>
        </register>
        <!-- REGISTER "PRLH0" -->
        <register>
          <name>PRLH0</name>
          <description>PPG0 Reload Registers High</description>
          <addressOffset>0x209</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLH" -->
            <field>
              <name>PRLH</name>
              <description>Reload Registers High</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLL0" -->
        <register>
          <name>PRLL0</name>
          <description>PPG0 Reload Registers Low</description>
          <addressOffset>0x208</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLL" -->
            <field>
              <name>PRLL</name>
              <description>Reload Registers Low</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLH1" -->
        <register derivedFrom="PRLH0">
          <name>PRLH1</name>
          <description>PPG1 Reload Registers High</description>
          <addressOffset>0x20D</addressOffset>
        </register>
        <!-- REGISTER "PRLL1" -->
        <register derivedFrom="PRLL0">
          <name>PRLL1</name>
          <description>PPG1 Reload Registers Low</description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "PRLH2" -->
        <register derivedFrom="PRLH0">
          <name>PRLH2</name>
          <description>PPG2 Reload Registers High</description>
          <addressOffset>0x211</addressOffset>
        </register>
        <!-- REGISTER "PRLL2" -->
        <register derivedFrom="PRLL0">
          <name>PRLL2</name>
          <description>PPG2 Reload Registers Low</description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "PRLH3" -->
        <register derivedFrom="PRLH0">
          <name>PRLH3</name>
          <description>PPG3 Reload Registers High</description>
          <addressOffset>0x215</addressOffset>
        </register>
